
## Plan Result (terraform/aws/palserver)

[CI link](https://github.com/boxp/arch/actions/runs/8359680071)


<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_iam_policy.palserver_gha_policy
  * aws_iam_role.palserver_gha_role
  * aws_iam_role_policy_attachment.palserver_gha_policy_attachment


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_policy.palserver_gha_policy will be created
  + resource "aws_iam_policy" "palserver_gha_policy" {
      + arn         = (known after apply)
      + description = "Policy for palserver GitHub Actions"
      + id          = (known after apply)
      + name        = "palserver-gha-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:UploadLayerPart",
                          + "ecr:CompleteLayerUpload",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ap-northeast-1:839695154978:repository/boxp/palserver"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.palserver_gha_role will be created
  + resource "aws_iam_role" "palserver_gha_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                              + "token.actions.githubusercontent.com:sub" = "repo:boxp/palserver:ref:refs/heads/main"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::839695154978:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "palserver-gha-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.palserver_gha_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "palserver_gha_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "palserver-gha-role"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":113,"Program":"tfcmt","SHA1":"cc62ee4e50f13cc740cd39b4dc4ae189186b41fb","Target":"terraform/aws/palserver","Vars":{},"WorkflowName":"pull_request_target"} -->